<template>
  <div class="admin__pannel">
    <div class="pannel_title">
      <h3>Админ панель</h3>
    </div>
    <p>
      Админ-панель — инструмент для управления веб-ресурсом и его настройками,
      добавления новых и удаления старых страниц, изменения внешнего вида
      веб-ресурса и редактирования контента. В зависимости от того, какая
      система управления контента (CMS) используется, способ доступа к
      админ-панели может отличаться. Если сайт был написан с нуля, а не с
      помощью CMS, то для внесения изменений необходимо изучение языков
      программирования.Чтобы зайти в админку, нужно сначала определить CMS, а
      потом авторизоваться в системе. Наиболее популярные CMS — Битрикс24,
      WordPress, Joomla, OpenCart. Определить систему управления ресурса можно
      вручную или с помощью онлайн-сервисов. В первом случае стоит
      воспользоваться HTML-кодом главной страницы.Админ-панель сайта - это часть
      движка, предназначенная для автоматического добавления контента на сайт.
      На ней есть поле, куда Вы пишете текст статьи. Админ панель содержит
      скрипты, которые создают новые страницы сайта либо добавляют статью в БД,
      в зависимости от структуры сайта. В меню добавляется ссылка на статью.
      Обычно админ-панель даёт возможность добавлять не только текст, но и
      другой контент. Создавая движок сайта, Вы сами решаете, делать
      админ-панель или добавлять статьи самостоятельно.
    </p>
  </div>
</template>

<style lang="scss" scoped>
h3 {
  text-align: left;
}
p {
  margin-top: 30px;
}
.admin__pannel{
  margin-left: -200px;
}
</style>